output/redis/workloadf/100.run-5.workloadf.txt
doTransactionReadModifyWrite
doTransactionReadModifyWrite
doTransactionReadModifyWrite
[...]
[OVERALL], RunTime(ms), 1052
[OVERALL], Throughput(ops/sec), 95.05703422053232
[TOTAL_GCS_PS_Scavenge], Count, 2
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 225
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 21.38783269961977
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 225
[TOTAL_GC_TIME_%], Time(%), 21.38783269961977
[READ], Operations, 100
[READ], AverageLatency(us), 1005.17
[READ], MinLatency(us), 111
[READ], MaxLatency(us), 16015
[READ], 95thPercentileLatency(us), 4415
[READ], 99thPercentileLatency(us), 7023
[READ], Return=OK, 100
[READ-MODIFY-WRITE], Operations, 49
[READ-MODIFY-WRITE], AverageLatency(us), 2248.2448979591836
[READ-MODIFY-WRITE], MinLatency(us), 313
[READ-MODIFY-WRITE], MaxLatency(us), 34015
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 7903
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 34015
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1168.0
[CLEANUP], MinLatency(us), 1168
[CLEANUP], MaxLatency(us), 1168
[CLEANUP], 95thPercentileLatency(us), 1168
[CLEANUP], 99thPercentileLatency(us), 1168
[UPDATE], Operations, 49
[UPDATE], AverageLatency(us), 465.2244897959184
[UPDATE], MinLatency(us), 115
[UPDATE], MaxLatency(us), 2061
[UPDATE], 95thPercentileLatency(us), 1765
[UPDATE], 99thPercentileLatency(us), 2061
[UPDATE], Return=OK, 49